avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <module name="PWM" id="PWM" version="6343H">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40094000"/>
            <signals>
              <signal pad="PA5" function="B" group="PWMFI" index="0"/>
              <signal pad="PA3" function="B" group="PWMFI" index="1"/>
              <signal pad="PD6" function="B" group="PWMFI" index="2"/>
              <signal pad="PA8" function="B" group="PWMH" index="0"/>
              <signal pad="PB12" function="B" group="PWMH" index="0"/>
              <signal pad="PC3" function="B" group="PWMH" index="0"/>
              <signal pad="PE15" function="A" group="PWMH" index="0"/>
              <signal pad="PA19" function="B" group="PWMH" index="1"/>
              <signal pad="PB13" function="B" group="PWMH" index="1"/>
              <signal pad="PC5" function="B" group="PWMH" index="1"/>
              <signal pad="PE16" function="A" group="PWMH" index="1"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PB14" function="B" group="PWMH" index="2"/>
              <signal pad="PC7" function="B" group="PWMH" index="2"/>
              <signal pad="PA9" function="B" group="PWMH" index="3"/>
              <signal pad="PB15" function="B" group="PWMH" index="3"/>
              <signal pad="PC9" function="B" group="PWMH" index="3"/>
              <signal pad="PF3" function="A" group="PWMH" index="3"/>
              <signal pad="PC20" function="B" group="PWMH" index="4"/>
              <signal pad="PE20" function="A" group="PWMH" index="4"/>
              <signal pad="PC19" function="B" group="PWMH" index="5"/>
              <signal pad="PE22" function="A" group="PWMH" index="5"/>
              <signal pad="PC18" function="B" group="PWMH" index="6"/>
              <signal pad="PE24" function="A" group="PWMH" index="6"/>
              <signal pad="PE26" function="A" group="PWMH" index="7"/>
              <signal pad="PA21" function="B" group="PWML" index="0"/>
              <signal pad="PB16" function="B" group="PWML" index="0"/>
              <signal pad="PC2" function="B" group="PWML" index="0"/>
              <signal pad="PE18" function="A" group="PWML" index="0"/>
              <signal pad="PA12" function="B" group="PWML" index="1"/>
              <signal pad="PB17" function="B" group="PWML" index="1"/>
              <signal pad="PC4" function="B" group="PWML" index="1"/>
              <signal pad="PA20" function="B" group="PWML" index="2"/>
              <signal pad="PB18" function="B" group="PWML" index="2"/>
              <signal pad="PC6" function="B" group="PWML" index="2"/>
              <signal pad="PE17" function="A" group="PWML" index="2"/>
              <signal pad="PA0" function="B" group="PWML" index="3"/>
              <signal pad="PB19" function="B" group="PWML" index="3"/>
              <signal pad="PC8" function="B" group="PWML" index="3"/>
              <signal pad="PB6" function="B" group="PWML" index="4"/>
              <signal pad="PC21" function="B" group="PWML" index="4"/>
              <signal pad="PE19" function="A" group="PWML" index="4"/>
              <signal pad="PB7" function="B" group="PWML" index="5"/>
              <signal pad="PC22" function="B" group="PWML" index="5"/>
              <signal pad="PE21" function="A" group="PWML" index="5"/>
              <signal pad="PB8" function="B" group="PWML" index="6"/>
              <signal pad="PC23" function="B" group="PWML" index="6"/>
              <signal pad="PE23" function="A" group="PWML" index="6"/>
              <signal pad="PB9" function="B" group="PWML" index="7"/>
              <signal pad="PC24" function="B" group="PWML" index="7"/>
              <signal pad="PE25" function="A" group="PWML" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="RSTC" version="11009A">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1A00"/>
          </instance>
        </module>
        <module name="RTC" id="RTC" version="6056I">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1A60"/>
          </instance>
        </module>
        <module name="RTT" id="RTT" version="6081F">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1A30"/>
          </instance>
        </module>
        <module name="SDRAMC" id="SDRAMC" version="6100N">
          <instance name="SDRAMC">
            <register-group address-space="base" name="SDRAMC" name-in-module="SDRAMC" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="SMC" id="SMC" version="6411D">
          <instance name="SMC">
            <register-group address-space="base" name="SMC" name-in-module="SMC" offset="0x400E0000"/>
          </instance>
        </module>
        <module name="SPI" id="SPI" version="6088R">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA25" function="A" group="SPI0_MISO"/>
              <signal pad="PA26" function="A" group="SPI0_MOSI"/>
              <signal pad="PA28" function="A" group="SPI0_NPCS" index="0"/>
              <signal pad="PA29" function="A" group="SPI0_NPCS" index="1"/>
              <signal pad="PB20" function="B" group="SPI0_NPCS" index="1"/>
              <signal pad="PA30" function="A" group="SPI0_NPCS" index="2"/>
              <signal pad="PB21" function="B" group="SPI0_NPCS" index="2"/>
              <signal pad="PA31" function="A" group="SPI0_NPCS" index="3"/>
              <signal pad="PB23" function="B" group="SPI0_NPCS" index="3"/>
              <signal pad="PA27" function="A" group="SPI0_SPCK"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0x4000C000"/>
            <signals>
              <signal pad="PE28" function="A" group="SPI1_MISO"/>
              <signal pad="PE29" function="A" group="SPI1_MOSI"/>
              <signal pad="PE31" function="A" group="SPI1_NPCS" index="0"/>
              <signal pad="PF0" function="A" group="SPI1_NPCS" index="1"/>
              <signal pad="PF1" function="A" group="SPI1_NPCS" index="2"/>
              <signal pad="PF2" function="A" group="SPI1_NPCS" index="3"/>
              <signal pad="PE30" function="A" group="SPI1_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SSC" id="SSC" version="6078J">
          <instance name="SSC">
            <register-group address-space="base" name="SSC" name-in-module="SSC" offset="0x40004000"/>
            <signals>
              <signal pad="PB18" function="A" group="RD"/>
              <signal pad="PB17" function="A" group="RF"/>
              <signal pad="PB19" function="A" group="RK"/>
              <signal pad="PA16" function="B" group="TD"/>
              <signal pad="PA15" function="B" group="TF"/>
              <signal pad="PA14" function="B" group="TK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" id="SUPC" version="6452L">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1A10"/>
