avrxml/AS6-Devices-XML/ATSAM3X8H.xml
          </instance>
        </module>
      <module name="FUSES" id="FUSES">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="LOCKBIT">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
      </peripherals>
      
      
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
      <interface type="swd" name="SWD"/>
      </interfaces>
    <property-groups>
          <property-group name="SIGNATURES">
            <property name="JTAGID" value="0x05B2B03F"/>
            <property name="CHIPID_CIDR" value="0x286E0A60"/>
            <property name="CHIPID_EXID" value="0x0"/>
          </property-group>
        </property-groups>
      </device>
  </devices>
  <modules>
    <module caption="Analog-to-digital Converter" name="ADC" version="6489I">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
        <register caption="Channel Sequence Register 1" name="ADC_SEQR1" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Sequence Number 1" mask="0x0000000F" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x000000F0" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x00000F00" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x0000F000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x000F0000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x00F00000" name="USCH6"/>
          <bitfield caption="User Sequence Number 7" mask="0x0F000000" name="USCH7"/>
          <bitfield caption="User Sequence Number 8" mask="0xF0000000" name="USCH8"/>
        </register>
        <register caption="Channel Sequence Register 2" name="ADC_SEQR2" offset="0x0C" rw="RW" size="4">
          <bitfield caption="User Sequence Number 9" mask="0x0000000F" name="USCH9"/>
          <bitfield caption="User Sequence Number 10" mask="0x000000F0" name="USCH10"/>
          <bitfield caption="User Sequence Number 11" mask="0x00000F00" name="USCH11"/>
          <bitfield caption="User Sequence Number 12" mask="0x0000F000" name="USCH12"/>
          <bitfield caption="User Sequence Number 13" mask="0x000F0000" name="USCH13"/>
          <bitfield caption="User Sequence Number 14" mask="0x00F00000" name="USCH14"/>
          <bitfield caption="User Sequence Number 15" mask="0x0F000000" name="USCH15"/>
          <bitfield caption="User Sequence Number 16" mask="0xF0000000" name="USCH16"/>
        </register>
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Enable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Enable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Enable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Enable" mask="0x00000800" name="CH11"/>
          <bitfield caption="Channel 12 Enable" mask="0x00001000" name="CH12"/>
          <bitfield caption="Channel 13 Enable" mask="0x00002000" name="CH13"/>
          <bitfield caption="Channel 14 Enable" mask="0x00004000" name="CH14"/>
          <bitfield caption="Channel 15 Enable" mask="0x00008000" name="CH15"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Disable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Disable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Disable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Disable" mask="0x00000800" name="CH11"/>
          <bitfield caption="Channel 12 Disable" mask="0x00001000" name="CH12"/>
          <bitfield caption="Channel 13 Disable" mask="0x00002000" name="CH13"/>
          <bitfield caption="Channel 14 Disable" mask="0x00004000" name="CH14"/>
          <bitfield caption="Channel 15 Disable" mask="0x00008000" name="CH15"/>
        </register>
