avrxml/AS6-Devices-XML/ATSAM3X8H.xml
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8K bytes" name="_8K" value="0x1"/>
        <value caption="16K bytes" name="_16K" value="0x2"/>
        <value caption="32K bytes" name="_32K" value="0x3"/>
        <value caption="64K bytes" name="_64K" value="0x5"/>
        <value caption="128K bytes" name="_128K" value="0x7"/>
        <value caption="256K bytes" name="_256K" value="0x9"/>
        <value caption="512K bytes" name="_512K" value="0xA"/>
        <value caption="1024K bytes" name="_1024K" value="0xC"/>
        <value caption="2048K bytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8K bytes" name="_8K" value="0x1"/>
        <value caption="16K bytes" name="_16K" value="0x2"/>
        <value caption="32K bytes" name="_32K" value="0x3"/>
        <value caption="64K bytes" name="_64K" value="0x5"/>
        <value caption="128K bytes" name="_128K" value="0x7"/>
        <value caption="256K bytes" name="_256K" value="0x9"/>
        <value caption="512K bytes" name="_512K" value="0xA"/>
        <value caption="1024K bytes" name="_1024K" value="0xC"/>
        <value caption="2048K bytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48K bytes" name="_48K" value="0x0"/>
        <value caption="1K bytes" name="_1K" value="0x1"/>
        <value caption="2K bytes" name="_2K" value="0x2"/>
        <value caption="6K bytes" name="_6K" value="0x3"/>
        <value caption="24K bytes" name="_24K" value="0x4"/>
        <value caption="4K bytes" name="_4K" value="0x5"/>
        <value caption="80K bytes" name="_80K" value="0x6"/>
        <value caption="160K bytes" name="_160K" value="0x7"/>
        <value caption="8K bytes" name="_8K" value="0x8"/>
        <value caption="16K bytes" name="_16K" value="0x9"/>
        <value caption="32K bytes" name="_32K" value="0xA"/>
        <value caption="64K bytes" name="_64K" value="0xB"/>
        <value caption="128K bytes" name="_128K" value="0xC"/>
        <value caption="256K bytes" name="_256K" value="0xD"/>
        <value caption="96K bytes" name="_96K" value="0xE"/>
        <value caption="512K bytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="AT91SAM9xx Series" name="AT91SAM9xx" value="0x19"/>
        <value caption="AT91SAM9XExx Series" name="AT91SAM9XExx" value="0x29"/>
        <value caption="AT91x34 Series" name="AT91x34" value="0x34"/>
        <value caption="CAP7 Series" name="CAP7" value="0x37"/>
        <value caption="CAP9 Series" name="CAP9" value="0x39"/>
        <value caption="CAP11 Series" name="CAP11" value="0x3B"/>
        <value caption="AT91x40 Series" name="AT91x40" value="0x40"/>
        <value caption="AT91x42 Series" name="AT91x42" value="0x42"/>
        <value caption="AT91x55 Series" name="AT91x55" value="0x55"/>
        <value caption="AT91SAM7Axx Series" name="AT91SAM7Axx" value="0x60"/>
        <value caption="AT91SAM7AQxx Series" name="AT91SAM7AQxx" value="0x61"/>
        <value caption="AT91x63 Series" name="AT91x63" value="0x63"/>
        <value caption="AT91SAM7Sxx Series" name="AT91SAM7Sxx" value="0x70"/>
        <value caption="AT91SAM7XCxx Series" name="AT91SAM7XCxx" value="0x71"/>
        <value caption="AT91SAM7SExx Series" name="AT91SAM7SExx" value="0x72"/>
        <value caption="AT91SAM7Lxx Series" name="AT91SAM7Lxx" value="0x73"/>
        <value caption="AT91SAM7Xxx Series" name="AT91SAM7Xxx" value="0x75"/>
        <value caption="AT91SAM7SLxx Series" name="AT91SAM7SLxx" value="0x76"/>
        <value caption="SAM3UxC Series (100-pin version)" name="SAM3UxC" value="0x80"/>
        <value caption="SAM3UxE Series (144-pin version)" name="SAM3UxE" value="0x81"/>
        <value caption="SAM3AxC Series (100-pin version)" name="SAM3AxC" value="0x83"/>
        <value caption="SAM4AxC Series (100-pin version)" name="SAM4AxC" value="0x83"/>
        <value caption="SAM3XxC Series (100-pin version)" name="SAM3XxC" value="0x84"/>
        <value caption="SAM4XxC Series (100-pin version)" name="SAM4XxC" value="0x84"/>
        <value caption="SAM3XxE Series (144-pin version)" name="SAM3XxE" value="0x85"/>
        <value caption="SAM4XxE Series (144-pin version)" name="SAM4XxE" value="0x85"/>
        <value caption="SAM3XxG Series (208/217-pin version)" name="SAM3XxG" value="0x86"/>
        <value caption="SAM4XxG Series (208/217-pin version)" name="SAM4XxG" value="0x86"/>
        <value caption="SAM3SxASeries (48-pin version)" name="SAM3SxA" value="0x88"/>
        <value caption="SAM4SxA Series (48-pin version)" name="SAM4SxA" value="0x88"/>
        <value caption="SAM3SxB Series (64-pin version)" name="SAM3SxB" value="0x89"/>
        <value caption="SAM4SxB Series (64-pin version)" name="SAM4SxB" value="0x89"/>
        <value caption="SAM3SxC Series (100-pin version)" name="SAM3SxC" value="0x8A"/>
        <value caption="SAM4SxC Series (100-pin version)" name="SAM4SxC" value="0x8A"/>
        <value caption="AT91x92 Series" name="AT91x92" value="0x92"/>
        <value caption="SAM3NxA Series (48-pin version)" name="SAM3NxA" value="0x93"/>
        <value caption="SAM3NxB Series (64-pin version)" name="SAM3NxB" value="0x94"/>
        <value caption="SAM3NxC Series (100-pin version)" name="SAM3NxC" value="0x95"/>
        <value caption="SAM3SDxB Series (64-pin version)" name="SAM3SDxB" value="0x99"/>
        <value caption="SAM3SDxC Series (100-pin version)" name="SAM3SDxC" value="0x9A"/>
        <value caption="SAM5A" name="SAM5A" value="0xA5"/>
        <value caption="AT75Cxx Series" name="AT75Cxx" value="0xF0"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash MemoryNVPSIZ is ROM size      NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module caption="Digital-to-Analog Converter Controller" name="DACC" version="6461F">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="DACC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL"/>
          <bitfield caption="Word Transfer" mask="0x00000010" name="WORD" values="DACC_MR__WORD"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP"/>
          <bitfield caption="Fast Wake up Mode" mask="0x00000040" name="FASTWKUP"/>
          <bitfield caption="Refresh Period" mask="0x0000FF00" name="REFRESH"/>
          <bitfield caption="User Channel Selection" mask="0x00030000" name="USER_SEL" values="DACC_MR__USER_SEL"/>
          <bitfield caption="Tag Selection Mode" mask="0x00100000" name="TAG" values="DACC_MR__TAG"/>
          <bitfield caption="Max Speed Mode" mask="0x00200000" name="MAXS" values="DACC_MR__MAXS"/>
          <bitfield caption="Startup Time Selection" mask="0x3F000000" name="STARTUP" values="DACC_MR__STARTUP"/>
        </register>
        <register caption="Channel Enable Register" name="DACC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Disable Register" name="DACC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Status Register" name="DACC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Conversion Data Register" name="DACC_CDR" offset="0x20" rw="W" size="4">
          <bitfield caption="Data to Convert" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Enable" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Disable." mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Disable" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Mask Register" name="DACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Mask" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000008" name="TXBUFE"/>
        </register>
