avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="DMAC Enable Register" name="DMAC_EN" offset="0x004" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="DMAC Software Single Request Register" name="DMAC_SREQ" offset="0x008" rw="RW" size="4">
          <bitfield caption="Source Request" mask="0x00000001" name="SSREQ0"/>
          <bitfield caption="Destination Request" mask="0x00000002" name="DSREQ0"/>
          <bitfield caption="Source Request" mask="0x00000004" name="SSREQ1"/>
          <bitfield caption="Destination Request" mask="0x00000008" name="DSREQ1"/>
          <bitfield caption="Source Request" mask="0x00000010" name="SSREQ2"/>
          <bitfield caption="Destination Request" mask="0x00000020" name="DSREQ2"/>
          <bitfield caption="Source Request" mask="0x00000040" name="SSREQ3"/>
          <bitfield caption="Destination Request" mask="0x00000080" name="DSREQ3"/>
          <bitfield caption="Source Request" mask="0x00000100" name="SSREQ4"/>
          <bitfield caption="Destination Request" mask="0x00000200" name="DSREQ4"/>
          <bitfield caption="Source Request" mask="0x00000400" name="SSREQ5"/>
          <bitfield caption="Destination Request" mask="0x00000800" name="DSREQ5"/>
        </register>
        <register caption="DMAC Software Chunk Transfer Request Register" name="DMAC_CREQ" offset="0x00C" rw="RW" size="4">
          <bitfield caption="Source Chunk Request" mask="0x00000001" name="SCREQ0"/>
          <bitfield caption="Destination Chunk Request" mask="0x00000002" name="DCREQ0"/>
          <bitfield caption="Source Chunk Request" mask="0x00000004" name="SCREQ1"/>
          <bitfield caption="Destination Chunk Request" mask="0x00000008" name="DCREQ1"/>
          <bitfield caption="Source Chunk Request" mask="0x00000010" name="SCREQ2"/>
          <bitfield caption="Destination Chunk Request" mask="0x00000020" name="DCREQ2"/>
          <bitfield caption="Source Chunk Request" mask="0x00000040" name="SCREQ3"/>
          <bitfield caption="Destination Chunk Request" mask="0x00000080" name="DCREQ3"/>
          <bitfield caption="Source Chunk Request" mask="0x00000100" name="SCREQ4"/>
          <bitfield caption="Destination Chunk Request" mask="0x00000200" name="DCREQ4"/>
          <bitfield caption="Source Chunk Request" mask="0x00000400" name="SCREQ5"/>
          <bitfield caption="Destination Chunk Request" mask="0x00000800" name="DCREQ5"/>
        </register>
        <register caption="DMAC Software Last Transfer Flag Register" name="DMAC_LAST" offset="0x010" rw="RW" size="4">
          <bitfield caption="Source Last" mask="0x00000001" name="SLAST0"/>
          <bitfield caption="Destination Last" mask="0x00000002" name="DLAST0"/>
          <bitfield caption="Source Last" mask="0x00000004" name="SLAST1"/>
          <bitfield caption="Destination Last" mask="0x00000008" name="DLAST1"/>
          <bitfield caption="Source Last" mask="0x00000010" name="SLAST2"/>
          <bitfield caption="Destination Last" mask="0x00000020" name="DLAST2"/>
          <bitfield caption="Source Last" mask="0x00000040" name="SLAST3"/>
          <bitfield caption="Destination Last" mask="0x00000080" name="DLAST3"/>
          <bitfield caption="Source Last" mask="0x00000100" name="SLAST4"/>
          <bitfield caption="Destination Last" mask="0x00000200" name="DLAST4"/>
          <bitfield caption="Source Last" mask="0x00000400" name="SLAST5"/>
          <bitfield caption="Destination Last" mask="0x00000800" name="DLAST5"/>
        </register>
        <register caption="DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Enable register." name="DMAC_EBCIER" offset="0x018" rw="W" size="4">
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000001" name="BTC0"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000002" name="BTC1"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000004" name="BTC2"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000008" name="BTC3"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000010" name="BTC4"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000020" name="BTC5"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000100" name="CBTC0"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000200" name="CBTC1"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000400" name="CBTC2"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000800" name="CBTC3"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00001000" name="CBTC4"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00002000" name="CBTC5"/>
          <bitfield caption="Access Error [5:0]" mask="0x00010000" name="ERR0"/>
          <bitfield caption="Access Error [5:0]" mask="0x00020000" name="ERR1"/>
          <bitfield caption="Access Error [5:0]" mask="0x00040000" name="ERR2"/>
          <bitfield caption="Access Error [5:0]" mask="0x00080000" name="ERR3"/>
          <bitfield caption="Access Error [5:0]" mask="0x00100000" name="ERR4"/>
          <bitfield caption="Access Error [5:0]" mask="0x00200000" name="ERR5"/>
        </register>
        <register caption="DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Disable register." name="DMAC_EBCIDR" offset="0x01C" rw="W" size="4">
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000001" name="BTC0"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000002" name="BTC1"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000004" name="BTC2"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000008" name="BTC3"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000010" name="BTC4"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000020" name="BTC5"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000100" name="CBTC0"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000200" name="CBTC1"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000400" name="CBTC2"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000800" name="CBTC3"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00001000" name="CBTC4"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00002000" name="CBTC5"/>
          <bitfield caption="Access Error [5:0]" mask="0x00010000" name="ERR0"/>
          <bitfield caption="Access Error [5:0]" mask="0x00020000" name="ERR1"/>
          <bitfield caption="Access Error [5:0]" mask="0x00040000" name="ERR2"/>
          <bitfield caption="Access Error [5:0]" mask="0x00080000" name="ERR3"/>
          <bitfield caption="Access Error [5:0]" mask="0x00100000" name="ERR4"/>
          <bitfield caption="Access Error [5:0]" mask="0x00200000" name="ERR5"/>
        </register>
        <register caption="DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Mask Register." name="DMAC_EBCIMR" offset="0x020" rw="R" size="4">
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000001" name="BTC0"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000002" name="BTC1"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000004" name="BTC2"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000008" name="BTC3"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000010" name="BTC4"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000020" name="BTC5"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000100" name="CBTC0"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000200" name="CBTC1"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000400" name="CBTC2"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000800" name="CBTC3"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00001000" name="CBTC4"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00002000" name="CBTC5"/>
          <bitfield caption="Access Error [5:0]" mask="0x00010000" name="ERR0"/>
          <bitfield caption="Access Error [5:0]" mask="0x00020000" name="ERR1"/>
          <bitfield caption="Access Error [5:0]" mask="0x00040000" name="ERR2"/>
          <bitfield caption="Access Error [5:0]" mask="0x00080000" name="ERR3"/>
          <bitfield caption="Access Error [5:0]" mask="0x00100000" name="ERR4"/>
          <bitfield caption="Access Error [5:0]" mask="0x00200000" name="ERR5"/>
        </register>
        <register caption="DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Status Register." name="DMAC_EBCISR" offset="0x024" rw="R" size="4">
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000001" name="BTC0"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000002" name="BTC1"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000004" name="BTC2"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000008" name="BTC3"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000010" name="BTC4"/>
          <bitfield caption="Buffer Transfer Completed [5:0]" mask="0x00000020" name="BTC5"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000100" name="CBTC0"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000200" name="CBTC1"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000400" name="CBTC2"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00000800" name="CBTC3"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00001000" name="CBTC4"/>
          <bitfield caption="Chained Buffer Transfer Completed [5:0]" mask="0x00002000" name="CBTC5"/>
          <bitfield caption="Access Error [5:0]" mask="0x00010000" name="ERR0"/>
          <bitfield caption="Access Error [5:0]" mask="0x00020000" name="ERR1"/>
          <bitfield caption="Access Error [5:0]" mask="0x00040000" name="ERR2"/>
          <bitfield caption="Access Error [5:0]" mask="0x00080000" name="ERR3"/>
          <bitfield caption="Access Error [5:0]" mask="0x00100000" name="ERR4"/>
          <bitfield caption="Access Error [5:0]" mask="0x00200000" name="ERR5"/>
        </register>
        <register caption="DMAC Channel Handler Enable Register" name="DMAC_CHER" offset="0x028" rw="W" size="4">
          <bitfield caption="Enable [5:0]" mask="0x00000001" name="ENA0"/>
          <bitfield caption="Enable [5:0]" mask="0x00000002" name="ENA1"/>
          <bitfield caption="Enable [5:0]" mask="0x00000004" name="ENA2"/>
          <bitfield caption="Enable [5:0]" mask="0x00000008" name="ENA3"/>
          <bitfield caption="Enable [5:0]" mask="0x00000010" name="ENA4"/>
          <bitfield caption="Enable [5:0]" mask="0x00000020" name="ENA5"/>
          <bitfield caption="Suspend [5:0]" mask="0x00000100" name="SUSP0"/>
          <bitfield caption="Suspend [5:0]" mask="0x00000200" name="SUSP1"/>
          <bitfield caption="Suspend [5:0]" mask="0x00000400" name="SUSP2"/>
          <bitfield caption="Suspend [5:0]" mask="0x00000800" name="SUSP3"/>
          <bitfield caption="Suspend [5:0]" mask="0x00001000" name="SUSP4"/>
          <bitfield caption="Suspend [5:0]" mask="0x00002000" name="SUSP5"/>
          <bitfield caption="Keep on [5:0]" mask="0x01000000" name="KEEP0"/>
          <bitfield caption="Keep on [5:0]" mask="0x02000000" name="KEEP1"/>
          <bitfield caption="Keep on [5:0]" mask="0x04000000" name="KEEP2"/>
          <bitfield caption="Keep on [5:0]" mask="0x08000000" name="KEEP3"/>
          <bitfield caption="Keep on [5:0]" mask="0x10000000" name="KEEP4"/>
          <bitfield caption="Keep on [5:0]" mask="0x20000000" name="KEEP5"/>
        </register>
        <register caption="DMAC Channel Handler Disable Register" name="DMAC_CHDR" offset="0x02C" rw="W" size="4">
          <bitfield caption="Disable [5:0]" mask="0x00000001" name="DIS0"/>
          <bitfield caption="Disable [5:0]" mask="0x00000002" name="DIS1"/>
          <bitfield caption="Disable [5:0]" mask="0x00000004" name="DIS2"/>
          <bitfield caption="Disable [5:0]" mask="0x00000008" name="DIS3"/>
          <bitfield caption="Disable [5:0]" mask="0x00000010" name="DIS4"/>
          <bitfield caption="Disable [5:0]" mask="0x00000020" name="DIS5"/>
          <bitfield caption="Resume [5:0]" mask="0x00000100" name="RES0"/>
          <bitfield caption="Resume [5:0]" mask="0x00000200" name="RES1"/>
          <bitfield caption="Resume [5:0]" mask="0x00000400" name="RES2"/>
          <bitfield caption="Resume [5:0]" mask="0x00000800" name="RES3"/>
          <bitfield caption="Resume [5:0]" mask="0x00001000" name="RES4"/>
          <bitfield caption="Resume [5:0]" mask="0x00002000" name="RES5"/>
        </register>
