avrxml/AS6-Devices-XML/ATSAM3X8H.xml
      <value-group caption="" name="HSMCI_WPSR__WP_VS">
        <value caption="No Write Protection Violation occurred since the last read of this register (WP_SR)" name="NONE" value="0x0"/>
        <value caption="Write Protection detected unauthorized attempt to write a control register had occurred (since the last read.)" name="WRITE" value="0x1"/>
        <value caption="Software reset had been performed while Write Protection was enabled (since the last read)." name="RESET" value="0x2"/>
        <value caption="Both Write Protection violation and software reset with Write Protection enabled have occurred since the last read." name="BOTH" value="0x3"/>
      </value-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" version="11060A">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 4" name="MATRIX_MCFG4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 5" name="MATRIX_MCFG5" offset="0x14" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 4" name="MATRIX_SCFG4" offset="0x50" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 5" name="MATRIX_SCFG5" offset="0x54" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 6" name="MATRIX_SCFG6" offset="0x58" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 7" name="MATRIX_SCFG7" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 8" name="MATRIX_SCFG8" offset="0x60" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
