avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="PWM Fault Status Register" name="PWM_FSR" offset="0x60" rw="R" size="4">
          <bitfield caption="Fault Input Value (fault input bit varies from 0 to 5)" mask="0x000000FF" name="FIV"/>
          <bitfield caption="Fault Status (fault input bit varies from 0 to 5)" mask="0x0000FF00" name="FS"/>
        </register>
        <register caption="PWM Fault Clear Register" name="PWM_FCR" offset="0x64" rw="W" size="4">
          <bitfield caption="Fault Clear (fault input bit varies from 0 to 5)" mask="0x000000FF" name="FCLR"/>
        </register>
        <register caption="PWM Fault Protection Value Register" name="PWM_FPV" offset="0x68" rw="RW" size="4">
          <bitfield caption="Fault Protection Value for PWMH output on channel 0" mask="0x00000001" name="FPVH0"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 1" mask="0x00000002" name="FPVH1"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 2" mask="0x00000004" name="FPVH2"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 3" mask="0x00000008" name="FPVH3"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 4" mask="0x00000010" name="FPVH4"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 5" mask="0x00000020" name="FPVH5"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 6" mask="0x00000040" name="FPVH6"/>
          <bitfield caption="Fault Protection Value for PWMH output on channel 7" mask="0x00000080" name="FPVH7"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 0" mask="0x00010000" name="FPVL0"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 1" mask="0x00020000" name="FPVL1"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 2" mask="0x00040000" name="FPVL2"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 3" mask="0x00080000" name="FPVL3"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 4" mask="0x00100000" name="FPVL4"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 5" mask="0x00200000" name="FPVL5"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 6" mask="0x00400000" name="FPVL6"/>
          <bitfield caption="Fault Protection Value for PWML output on channel 7" mask="0x00800000" name="FPVL7"/>
        </register>
        <register caption="PWM Fault Protection Enable Register 1" name="PWM_FPE1" offset="0x6C" rw="RW" size="4">
          <bitfield caption="Fault Protection Enable for channel 0 (fault input bit varies from 0 to 5)" mask="0x000000FF" name="FPE0"/>
          <bitfield caption="Fault Protection Enable for channel 1 (fault input bit varies from 0 to 5)" mask="0x0000FF00" name="FPE1"/>
          <bitfield caption="Fault Protection Enable for channel 2 (fault input bit varies from 0 to 5)" mask="0x00FF0000" name="FPE2"/>
          <bitfield caption="Fault Protection Enable for channel 3 (fault input bit varies from 0 to 5)" mask="0xFF000000" name="FPE3"/>
        </register>
        <register caption="PWM Fault Protection Enable Register 2" name="PWM_FPE2" offset="0x70" rw="RW" size="4">
          <bitfield caption="Fault Protection Enable for channel 4 (fault input bit varies from 0 to 5)" mask="0x000000FF" name="FPE4"/>
          <bitfield caption="Fault Protection Enable for channel 5 (fault input bit varies from 0 to 5)" mask="0x0000FF00" name="FPE5"/>
          <bitfield caption="Fault Protection Enable for channel 6 (fault input bit varies from 0 to 5)" mask="0x00FF0000" name="FPE6"/>
          <bitfield caption="Fault Protection Enable for channel 7 (fault input bit varies from 0 to 5)" mask="0xFF000000" name="FPE7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 0" name="PWM_ELMR0" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 1" name="PWM_ELMR1" offset="0x80" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Stepper Motor Mode Register" name="PWM_SMMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Gray Count ENable" mask="0x00000001" name="GCEN0"/>
          <bitfield caption="Gray Count ENable" mask="0x00000002" name="GCEN1"/>
          <bitfield caption="Gray Count ENable" mask="0x00000004" name="GCEN2"/>
          <bitfield caption="Gray Count ENable" mask="0x00000008" name="GCEN3"/>
          <bitfield caption="DOWN Count" mask="0x00010000" name="DOWN0"/>
          <bitfield caption="DOWN Count" mask="0x00020000" name="DOWN1"/>
          <bitfield caption="DOWN Count" mask="0x00040000" name="DOWN2"/>
          <bitfield caption="DOWN Count" mask="0x00080000" name="DOWN3"/>
        </register>
