avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="PWM Channel Duty Cycle Register (ch_num = 7)" name="PWM_CDTY7" offset="0x2E4" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register (ch_num = 7)" name="PWM_CDTYUPD7" offset="0x2E8" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 7)" name="PWM_CPRD7" offset="0x2EC" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Period Update Register (ch_num = 7)" name="PWM_CPRDUPD7" offset="0x2F0" rw="W" size="4">
          <bitfield caption="Channel Period Update" mask="0x00FFFFFF" name="CPRDUPD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 7)" name="PWM_CCNT7" offset="0x2F4" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0x00FFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Dead Time Register (ch_num = 7)" name="PWM_DT7" offset="0x2F8" rw="RW" size="4">
          <bitfield caption="Dead-Time Value for PWMHx Output" mask="0x0000FFFF" name="DTH"/>
          <bitfield caption="Dead-Time Value for PWMLx Output" mask="0xFFFF0000" name="DTL"/>
        </register>
        <register caption="PWM Channel Dead Time Update Register (ch_num = 7)" name="PWM_DTUPD7" offset="0x2FC" rw="W" size="4">
          <bitfield caption="Dead-Time Value Update for PWMHx Output" mask="0x0000FFFF" name="DTHUPD"/>
          <bitfield caption="Dead-Time Value Update for PWMLx Output" mask="0xFFFF0000" name="DTLUPD"/>
        </register>
        <register caption="Transmit Pointer Register" name="PWM_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="PWM_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="PWM_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="PWM_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PWM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PWM_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="PWM_SCM__UPDM">
        <value caption="Manual write of double buffer registers and manual update of synchronous channels" name="MODE0" value="0x0"/>
        <value caption="Manual write of double buffer registers and automatic update of synchronous channels" name="MODE1" value="0x1"/>
        <value caption="Automatic write of duty-cycle update registers by the PDC and automatic update of synchronous channels" name="MODE2" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CMR0__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR1__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR2__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
