avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="SDRAMC Low Power Register" name="SDRAMC_LPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Low-power Configuration Bits" mask="0x00000003" name="LPCB" values="SDRAMC_LPR__LPCB"/>
          <bitfield caption="Partial Array Self-refresh (only for low-power SDRAM)" mask="0x00000070" name="PASR"/>
          <bitfield caption="Temperature Compensated Self-Refresh (only for low-power SDRAM)" mask="0x00000300" name="TCSR"/>
          <bitfield caption="Drive Strength (only for low-power SDRAM)" mask="0x00000C00" name="DS"/>
          <bitfield caption="Time to define when low-power mode is enable" mask="0x00003000" name="TIMEOUT" values="SDRAMC_LPR__TIMEOUT"/>
        </register>
        <register caption="SDRAMC Interrupt Enable Register" name="SDRAMC_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Disable Register" name="SDRAMC_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Mask Register" name="SDRAMC_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Interrupt Status Register" name="SDRAMC_ISR" offset="0x20" rw="R" size="4">
          <bitfield caption="Refresh Error Status" mask="0x00000001" name="RES"/>
        </register>
        <register caption="SDRAMC Memory Device Register" name="SDRAMC_MDR" offset="0x24" rw="RW" size="4">
          <bitfield caption="Memory Device Type" mask="0x00000003" name="MD" values="SDRAMC_MDR__MD"/>
        </register>
        <register caption="SDRAMC Configuration Register 1" name="SDRAMC_CR1" offset="0x28" rw="RW" size="4">
          <bitfield caption="Number of Column Bits" mask="0x00000003" name="NC" values="SDRAMC_CR1__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x0000000C" name="NR" values="SDRAMC_CR1__NR"/>
          <bitfield caption="Number of Banks" mask="0x00000010" name="NB" values="SDRAMC_CR1__NB"/>
          <bitfield caption="CAS Latency" mask="0x00000060" name="CAS" values="SDRAMC_CR1__CAS"/>
          <bitfield caption="Data Bus Width" mask="0x00000080" name="DBW"/>
          <bitfield caption="Write Recovery Delay" mask="0x00000F00" name="TWR"/>
          <bitfield caption="Row Cycle Delay and Row Refresh Cycle" mask="0x0000F000" name="TRC_TRFC"/>
          <bitfield caption="Row Precharge Delay" mask="0x000F0000" name="TRP"/>
          <bitfield caption="Row to Column Delay" mask="0x00F00000" name="TRCD"/>
          <bitfield caption="Active to Precharge Delay" mask="0x0F000000" name="TRAS"/>
          <bitfield caption="Exit Self Refresh to Active Delay" mask="0xF0000000" name="TXSR"/>
        </register>
        <register caption="SDRAMC OCMS Register 1" name="SDRAMC_OCMS" offset="0x2C" rw="RW" size="4">
          <bitfield caption="SDRAM Memory Controller Scrambling Enable" mask="0x00000001" name="SDR_SE"/>
        </register>
      </register-group>
      <value-group caption="" name="SDRAMC_MR__MODE">
        <value caption="Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, command must be followed by a write to the SDRAM." name="NORMAL" value="0x0"/>
        <value caption="The SDRAM Controller issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." name="NOP" value="0x1"/>
        <value caption="The SDRAM Controller issues an &#34;All Banks Precharge&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." name="ALLBANKS_PRECHARGE" value="0x2"/>
        <value caption="The SDRAM Controller issues a &#34;Load Mode Register&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM." name="LOAD_MODEREG" value="0x3"/>
        <value caption="The SDRAM Controller issues an &#34;Auto-Refresh&#34; Command when the SDRAM device is accessed regardless of the cycle. Previously, an &#34;All Banks Precharge&#34; command must be issued. To activate this mode, command must be followed by a write to the SDRAM." name="AUTO_REFRESH" value="0x4"/>
        <value caption="The SDRAM Controller issues an &#34;Extended Load Mode Register&#34; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the &#34;Extended Load Mode Register&#34; command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1." name="EXT_LOAD_MODEREG" value="0x5"/>
        <value caption="Deep power-down mode. Enters deep power-down mode." name="DEEP_POWERDOWN" value="0x6"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NC">
        <value caption="8 column bits" name="COL8" value="0x0"/>
        <value caption="9 column bits" name="COL9" value="0x1"/>
        <value caption="10 column bits" name="COL10" value="0x2"/>
        <value caption="11 column bits" name="COL11" value="0x3"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NR">
        <value caption="11 row bits" name="ROW11" value="0x0"/>
        <value caption="12 row bits" name="ROW12" value="0x1"/>
        <value caption="13 row bits" name="ROW13" value="0x2"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__NB">
        <value caption="2 banks" name="BANK2" value="0"/>
        <value caption="4 banks" name="BANK4" value="1"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR__CAS">
        <value caption="1 cycle CAS latency" name="LATENCY1" value="0x1"/>
        <value caption="2 cycle CAS latency" name="LATENCY2" value="0x2"/>
        <value caption="3 cycle CAS latency" name="LATENCY3" value="0x3"/>
      </value-group>
