avrxml/AS6-Devices-XML/ATSAM3X8H.xml
      <value-group caption="" name="SDRAMC_LPR__LPCB">
        <value caption="Low Power Feature is inhibited: no Power-down, Self-refresh or Deep Power-down command is issued to the SDRAM device." name="DISABLED" value="0x0"/>
        <value caption="The SDRAM Controller issues a Self-refresh command to the SDRAM device, the SDCK clock is deactivated and the SDCKE signal is set low. The SDRAM device leaves the Self Refresh Mode when accessed and enters it after the access." name="SELF_REFRESH" value="0x1"/>
        <value caption="The SDRAM Controller issues a Power-down Command to the SDRAM device after each access, the SDCKE signal is set to low. The SDRAM device leaves the Power-down Mode when accessed and enters it after the access." name="POWER_DOWN" value="0x2"/>
        <value caption="The SDRAM Controller issues a Deep Power-down command to the SDRAM device. This mode is unique to low-power SDRAM." name="DEEP_POWER_DOWN" value="0x3"/>
      </value-group>
      <value-group caption="" name="SDRAMC_LPR__TIMEOUT">
        <value caption="The SDRAM controller activates the SDRAM low-power mode immediately after the end of the last transfer." name="LP_LAST_XFER" value="0x0"/>
        <value caption="The SDRAM controller activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer." name="LP_LAST_XFER_64" value="0x1"/>
        <value caption="The SDRAM controller activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer." name="LP_LAST_XFER_128" value="0x2"/>
      </value-group>
      <value-group caption="" name="SDRAMC_MDR__MD">
        <value caption="SDRAM" name="SDRAM" value="0x0"/>
        <value caption="Low-power SDRAM" name="LPSDRAM" value="0x1"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR1__NC">
        <value caption="8 column bits" name="COL8" value="0x0"/>
        <value caption="9 column bits" name="COL9" value="0x1"/>
        <value caption="10 column bits" name="COL10" value="0x2"/>
        <value caption="11 column bits" name="COL11" value="0x3"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR1__NR">
        <value caption="11 row bits" name="ROW11" value="0x0"/>
        <value caption="12 row bits" name="ROW12" value="0x1"/>
        <value caption="13 row bits" name="ROW13" value="0x2"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR1__NB">
        <value caption="2 banks" name="BANK2" value="0"/>
        <value caption="4 banks" name="BANK4" value="1"/>
      </value-group>
      <value-group caption="" name="SDRAMC_CR1__CAS">
        <value caption="1 cycle CAS latency" name="LATENCY1" value="0x1"/>
        <value caption="2 cycle CAS latency" name="LATENCY2" value="0x2"/>
        <value caption="3 cycle CAS latency" name="LATENCY3" value="0x3"/>
      </value-group>
    </module>
    <module caption="Static Memory Controller" name="SMC" version="6411D">
      <register-group name="SMC">
        <register caption="SMC NFC Configuration Register" name="SMC_CFG" offset="0x000" rw="RW" size="4">
          <bitfield caption="" mask="0x00000003" name="PAGESIZE" values="SMC_CFG__PAGESIZE"/>
          <bitfield caption="Write Spare Area" mask="0x00000100" name="WSPARE"/>
          <bitfield caption="Read Spare Area" mask="0x00000200" name="RSPARE"/>
          <bitfield caption="Rising/Falling Edge Detection Control" mask="0x00001000" name="EDGECTRL"/>
          <bitfield caption="Ready/Busy Signal Edge Detection" mask="0x00002000" name="RBEDGE"/>
          <bitfield caption="Data Timeout Cycle Number" mask="0x000F0000" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00700000" name="DTOMUL" values="SMC_CFG__DTOMUL"/>
        </register>
        <register caption="SMC NFC Control Register" name="SMC_CTRL" offset="0x004" rw="W" size="4">
          <bitfield caption="NAND Flash Controller Enable" mask="0x00000001" name="NFCEN"/>
          <bitfield caption="NAND Flash Controller Disable" mask="0x00000002" name="NFCDIS"/>
        </register>
        <register caption="SMC NFC Status Register" name="SMC_SR" offset="0x008" rw="R" size="4">
          <bitfield caption="NAND Flash Controller status (this field cannot be reset)" mask="0x00000001" name="SMCSTS"/>
          <bitfield caption="Selected Ready Busy Rising Edge Detected" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Selected Ready Busy Falling Edge Detected" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="NFC Busy (this field cannot be reset)" mask="0x00000100" name="NFCBUSY"/>
          <bitfield caption="NFC Write/Read Operation (this field cannot be reset)" mask="0x00000800" name="NFCWR"/>
          <bitfield caption="NFC Chip Select ID (this field cannot be reset)" mask="0x00007000" name="NFCSID"/>
          <bitfield caption="NFC Data Transfer Terminated" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Error" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Edge Detected" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Enable Register" name="SMC_IER" offset="0x00C" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Enable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Enable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Enable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Enable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Enable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Enable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Enable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Enable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Enable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Disable Register" name="SMC_IDR" offset="0x010" rw="W" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Disable" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Disable" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Disable" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Disable" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Disable" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Disable" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Disable" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Disable" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Disable" mask="0x01000000" name="RB_EDGE0"/>
        </register>
        <register caption="SMC NFC Interrupt Mask Register" name="SMC_IMR" offset="0x014" rw="R" size="4">
          <bitfield caption="Ready Busy Rising Edge Detection Interrupt Mask" mask="0x00000010" name="RB_RISE"/>
          <bitfield caption="Ready Busy Falling Edge Detection Interrupt Mask" mask="0x00000020" name="RB_FALL"/>
          <bitfield caption="Transfer Done Interrupt Mask" mask="0x00010000" name="XFRDONE"/>
          <bitfield caption="Command Done Interrupt Mask" mask="0x00020000" name="CMDDONE"/>
          <bitfield caption="Data Timeout Error Interrupt Mask" mask="0x00100000" name="DTOE"/>
          <bitfield caption="Undefined Area Access Interrupt Mask5" mask="0x00200000" name="UNDEF"/>
          <bitfield caption="Accessing While Busy Interrupt Mask" mask="0x00400000" name="AWB"/>
          <bitfield caption="NFC Access Size Error Interrupt Mask" mask="0x00800000" name="NFCASE"/>
          <bitfield caption="Ready/Busy Line 0 Interrupt Mask" mask="0x01000000" name="RB_EDGE0"/>
        </register>
