avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="FWUP Wake Up Status" mask="0x00000001" name="FWUPS" values="SUPC_SR__FWUPS"/>
          <bitfield caption="WKUP Wake Up Status" mask="0x00000002" name="WKUPS" values="SUPC_SR__WKUPS"/>
          <bitfield caption="Supply Monitor Detection Wake Up Status" mask="0x00000004" name="SMWS" values="SUPC_SR__SMWS"/>
          <bitfield caption="Brownout Detector Reset Status" mask="0x00000008" name="BODRSTS" values="SUPC_SR__BODRSTS"/>
          <bitfield caption="Supply Monitor Reset Status" mask="0x00000010" name="SMRSTS" values="SUPC_SR__SMRSTS"/>
          <bitfield caption="Supply Monitor Status" mask="0x00000020" name="SMS" values="SUPC_SR__SMS"/>
          <bitfield caption="Supply Monitor Output Status" mask="0x00000040" name="SMOS" values="SUPC_SR__SMOS"/>
          <bitfield caption="32-kHz Oscillator Selection Status" mask="0x00000080" name="OSCSEL" values="SUPC_SR__OSCSEL"/>
          <bitfield caption="FWUP Input Status" mask="0x00001000" name="FWUPIS" values="SUPC_SR__FWUPIS"/>
          <bitfield caption="WKUP Input Status 0" mask="0x00010000" name="WKUPIS0" values="SUPC_SR__WKUPIS0"/>
          <bitfield caption="WKUP Input Status 1" mask="0x00020000" name="WKUPIS1" values="SUPC_SR__WKUPIS1"/>
          <bitfield caption="WKUP Input Status 2" mask="0x00040000" name="WKUPIS2" values="SUPC_SR__WKUPIS2"/>
          <bitfield caption="WKUP Input Status 3" mask="0x00080000" name="WKUPIS3" values="SUPC_SR__WKUPIS3"/>
          <bitfield caption="WKUP Input Status 4" mask="0x00100000" name="WKUPIS4" values="SUPC_SR__WKUPIS4"/>
          <bitfield caption="WKUP Input Status 5" mask="0x00200000" name="WKUPIS5" values="SUPC_SR__WKUPIS5"/>
          <bitfield caption="WKUP Input Status 6" mask="0x00400000" name="WKUPIS6" values="SUPC_SR__WKUPIS6"/>
          <bitfield caption="WKUP Input Status 7" mask="0x00800000" name="WKUPIS7" values="SUPC_SR__WKUPIS7"/>
          <bitfield caption="WKUP Input Status 8" mask="0x01000000" name="WKUPIS8" values="SUPC_SR__WKUPIS8"/>
          <bitfield caption="WKUP Input Status 9" mask="0x02000000" name="WKUPIS9" values="SUPC_SR__WKUPIS9"/>
          <bitfield caption="WKUP Input Status 10" mask="0x04000000" name="WKUPIS10" values="SUPC_SR__WKUPIS10"/>
          <bitfield caption="WKUP Input Status 11" mask="0x08000000" name="WKUPIS11" values="SUPC_SR__WKUPIS11"/>
          <bitfield caption="WKUP Input Status 12" mask="0x10000000" name="WKUPIS12" values="SUPC_SR__WKUPIS12"/>
          <bitfield caption="WKUP Input Status 13" mask="0x20000000" name="WKUPIS13" values="SUPC_SR__WKUPIS13"/>
          <bitfield caption="WKUP Input Status 14" mask="0x40000000" name="WKUPIS14" values="SUPC_SR__WKUPIS14"/>
          <bitfield caption="WKUP Input Status 15" mask="0x80000000" name="WKUPIS15" values="SUPC_SR__WKUPIS15"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__VROFF">
        <value caption="no effect." name="NO_EFFECT" value="0"/>
        <value caption="if KEY is correct, asserts vddcore_nreset and stops the voltage regulator." name="STOP_VREG" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__XTALSEL">
        <value caption="no effect." name="NO_EFFECT" value="0"/>
        <value caption="if KEY is correct, switches the slow clock on the crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMTH">
        <value caption="1.9 V" name="_1_9V" value="0x0"/>
        <value caption="2.0 V" name="_2_0V" value="0x1"/>
        <value caption="2.1 V" name="_2_1V" value="0x2"/>
        <value caption="2.2 V" name="_2_2V" value="0x3"/>
        <value caption="2.3 V" name="_2_3V" value="0x4"/>
        <value caption="2.4 V" name="_2_4V" value="0x5"/>
        <value caption="2.5 V" name="_2_5V" value="0x6"/>
        <value caption="2.6 V" name="_2_6V" value="0x7"/>
        <value caption="2.7 V" name="_2_7V" value="0x8"/>
        <value caption="2.8 V" name="_2_8V" value="0x9"/>
        <value caption="2.9 V" name="_2_9V" value="0xA"/>
        <value caption="3.0 V" name="_3_0V" value="0xB"/>
        <value caption="3.1 V" name="_3_1V" value="0xC"/>
        <value caption="3.2 V" name="_3_2V" value="0xD"/>
        <value caption="3.3 V" name="_3_3V" value="0xE"/>
        <value caption="3.4 V" name="_3_4V" value="0xF"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enabled one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enabled one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enabled one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="the core reset signal &#34;vddcore_nreset&#34; is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="the core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="the SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="the SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="the core reset signal &#34;vddcore_nreset&#34; is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="the core reset signal, vddcore_nreset is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="the core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="the core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="no effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="the 32-KHz XTAL oscillator is selected and is put in bypass mode." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__FWUPEN">
        <value caption="the Force Wake Up pin has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the Force Wake Up pin low forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__SMEN">
        <value caption="the supply monitor detection has no wake up effect." name="NOT_ENABLE" value="0"/>
        <value caption="the supply monitor detection forces the wake up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
