avrxml/AS6-Devices-XML/ATSAM3X8H.xml
      <value-group caption="" name="TC_CMR2__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR2__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOA" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOA" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOA" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
    </module>
    <module caption="True Random Number Generator" name="TRNG" version="6334B">
      <register-group name="TRNG">
        <register caption="Control Register" name="TRNG_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Enables the TRNG to provide random values" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Security Key" mask="0xFFFFFF00" name="KEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="TRNG_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="TRNG_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="TRNG_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="TRNG_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Output Data Register" name="TRNG_ODATA" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
      </register-group>
    </module>
    <module caption="Two-wire Interface" name="TWI" version="6212L">
      <register-group name="TWI">
        <register caption="Control Register" name="TWI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Send a START Condition" mask="0x00000001" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" name="MSEN"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" name="MSDIS"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" name="SVEN"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" name="SVDIS"/>
          <bitfield caption="SMBUS Quick Command" mask="0x00000040" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Master Mode Register" name="TWI_MMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="TWI_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
        </register>
        <register caption="Slave Mode Register" name="TWI_SMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
        </register>
        <register caption="Internal Address Register" name="TWI_IADR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="Clock Waveform Generator Register" name="TWI_CWGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
        </register>
        <register caption="Status Register" name="TWI_SR" offset="0x20" rw="R" size="4">
          <bitfield caption="Transmission Completed (automatically set / reset)" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (automatically set / reset)" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (automatically set / reset)" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Read (automatically set / reset)" mask="0x00000008" name="SVREAD"/>
          <bitfield caption="Slave Access (automatically set / reset)" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access (clear on read)" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error (clear on read)" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledged (clear on read)" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost (clear on read)" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State (automatically set / reset)" mask="0x00000400" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (clear on read)" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of RX buffer" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of TX buffer" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="RX Buffer Full" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Enable Register" name="TWI_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Disable Register" name="TWI_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Mask Register" name="TWI_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Receive Holding Register" name="TWI_RHR" offset="0x30" rw="R" size="4">
          <bitfield caption="Master or Slave Receive Holding Data" mask="0x000000FF" name="RXDATA"/>
        </register>
