avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="Device Endpoint Clear Register (n = 0) 6" name="UOTGHS_DEVEPTICR6" offset="0x178" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Clear" mask="0x00000008" name="HBISOINERRIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 7" name="UOTGHS_DEVEPTICR7" offset="0x17C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Clear" mask="0x00000008" name="HBISOINERRIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 8" name="UOTGHS_DEVEPTICR8" offset="0x180" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Clear" mask="0x00000008" name="HBISOINERRIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 9" name="UOTGHS_DEVEPTICR9" offset="0x184" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Clear" mask="0x00000008" name="HBISOINERRIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 0" name="UOTGHS_DEVEPTIFR0" offset="0x190" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Set" mask="0x00000008" name="HBISOINERRIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Set" mask="0x00000010" name="HBISOFLUSHIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 1" name="UOTGHS_DEVEPTIFR1" offset="0x194" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Set" mask="0x00000008" name="HBISOINERRIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Set" mask="0x00000010" name="HBISOFLUSHIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
