avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="Device Endpoint Set Register (n = 0) 8" name="UOTGHS_DEVEPTIFR8" offset="0x1B0" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Set" mask="0x00000008" name="HBISOINERRIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Set" mask="0x00000010" name="HBISOFLUSHIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 9" name="UOTGHS_DEVEPTIFR9" offset="0x1B4" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="High bandwidth isochronous IN Underflow Error Interrupt Set" mask="0x00000008" name="HBISOINERRIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Set" mask="0x00000010" name="HBISOFLUSHIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 0" name="UOTGHS_DEVEPTIMR0" offset="0x1C0" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 1" name="UOTGHS_DEVEPTIMR1" offset="0x1C4" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 2" name="UOTGHS_DEVEPTIMR2" offset="0x1C8" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
