avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="Device Endpoint Mask Register (n = 0) 3" name="UOTGHS_DEVEPTIMR3" offset="0x1CC" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 4" name="UOTGHS_DEVEPTIMR4" offset="0x1D0" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 5" name="UOTGHS_DEVEPTIMR5" offset="0x1D4" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 6" name="UOTGHS_DEVEPTIMR6" offset="0x1D8" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 7" name="UOTGHS_DEVEPTIMR7" offset="0x1DC" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="Underflow Interrupt" mask="0x00000004" name="UNDERFE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt" mask="0x00000008" name="HBISOINERRE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt" mask="0x00000010" name="HBISOFLUSHE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="MData Interrupt" mask="0x00000100" name="MDATAE"/>
          <bitfield caption="DataX Interrupt" mask="0x00000200" name="DATAXE"/>
          <bitfield caption="Transaction Error Interrupt" mask="0x00000400" name="ERRORTRANSE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
