avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="Device Endpoint Enable Register (n = 0) 9" name="UOTGHS_DEVEPTIER9" offset="0x214" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Enable" mask="0x00000008" name="HBISOINERRES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Enable" mask="0x00000010" name="HBISOFLUSHES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="MData Interrupt Enable" mask="0x00000100" name="MDATAES"/>
          <bitfield caption="DataX Interrupt Enable" mask="0x00000200" name="DATAXES"/>
          <bitfield caption="Transaction Error Interrupt Enable" mask="0x00000400" name="ERRORTRANSES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 0" name="UOTGHS_DEVEPTIDR0" offset="0x220" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Clear" mask="0x00000008" name="HBISOINERREC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERREC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="MData Interrupt Clear" mask="0x00000100" name="MDATEC"/>
          <bitfield caption="DataX Interrupt Clear" mask="0x00000200" name="DATAXEC"/>
          <bitfield caption="Transaction Error Interrupt Clear" mask="0x00000400" name="ERRORTRANSEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 1" name="UOTGHS_DEVEPTIDR1" offset="0x224" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Clear" mask="0x00000008" name="HBISOINERREC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERREC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="MData Interrupt Clear" mask="0x00000100" name="MDATEC"/>
          <bitfield caption="DataX Interrupt Clear" mask="0x00000200" name="DATAXEC"/>
          <bitfield caption="Transaction Error Interrupt Clear" mask="0x00000400" name="ERRORTRANSEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 2" name="UOTGHS_DEVEPTIDR2" offset="0x228" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Error Interrupt Clear" mask="0x00000008" name="HBISOINERREC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="High Bandwidth Isochronous IN Flush Interrupt Clear" mask="0x00000010" name="HBISOFLUSHEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERREC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="MData Interrupt Clear" mask="0x00000100" name="MDATEC"/>
          <bitfield caption="DataX Interrupt Clear" mask="0x00000200" name="DATAXEC"/>
          <bitfield caption="Transaction Error Interrupt Clear" mask="0x00000400" name="ERRORTRANSEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
