avrxml/AS6-Devices-XML/ATSAM3X8H.xml
        <register caption="Host Pipe Mask Register (n = 0) 1" name="UOTGHS_HSTPIPIMR1" offset="0x5C4" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 2" name="UOTGHS_HSTPIPIMR2" offset="0x5C8" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 3" name="UOTGHS_HSTPIPIMR3" offset="0x5CC" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 4" name="UOTGHS_HSTPIPIMR4" offset="0x5D0" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Mask Register (n = 0) 5" name="UOTGHS_HSTPIPIMR5" offset="0x5D4" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
